laravel/app/Http/Controllers/CategoriesController.php

    public function scienceArticles(){
        $articles = DB::table('articles')->where('category_id', '5')->get();
---
select * from `articles` where `category_id` = '5'