laravel/app/Http/Controllers/PostsController.php

    public function createpost(Request $request)
    {
        DB::table('articles')->insert( ['category_id' => $_POST['category'], 'user_id' => 1, 'title' => $_POST['title'], 'text' => $_POST['text'], 'image' => '' ] );
---
insert into `articles` (`category_id`, `user_id`, `title`, `text`, `image`) values ('1', '1', 'ov', 'ov', '')

    public function getCategories(){
        $categories = DB::table('categories')->get();
---
select * from `categories`