<?php $__env->startSection('content'); ?>
    <div class="row">
        <div class="col-md-6 col-md-offset-3">
            <div class="panel panel-primary">
                <div class="panel-heading">
                    <h3 class="panel-title"> Реєстрація </h3>
                </div>


                <div class="panel-body">
                    <form action="/register" method="POST">
                        <?php echo e(csrf_field()); ?>


                        <div class="form-group">
                            <div class="input-group">
                               <span class="input-group-addon"><i class="fa fa-envelope"></i></span>

                                <input type="email" name="email" class="form-control" placeholder="example@example.com" required>
                            </div>
                        </div>


                        <div class="form-group">
                            <div class="input-group">
                                <span class="input-group-addon"><i class="fa fa-user"></i></span>

                                <input type="text" name="user_name" class="form-control" placeholder="Ім'я користувача" required>
                            </div>
                        </div>

                        <div class="form-group">
                            <div class="input-group">
                                <span class="input-group-addon"><i class="fa fa-lock"></i></span>

                                <input type="password" name="password" class="form-control" placeholder="Пароль" required>
                            </div>
                        </div>

                        <div class="form-group">
                            <div class="input-group">
                                <span class="input-group-addon"><i class="fa fa-lock"></i></span>

                                <input type="password" name="password_confirmation" class="form-control" placeholder="Підтверження паролю" required>
                            </div>
                        </div>
                        <input class="modal__check" type="checkbox" id="modal"/>
                        <div class="modal">
                            <label class="modal__closetwo" for="modal"></label>
                            <div class="modal__info">
                                <label class="modal__close" for="modal">&times;</label>
                                <h2>Умови сайту</h2>
                                <p>
                                <h3>1. Контент сайту</h3>
                                    <p>1.1. Матеріали, опубліковані на сайті, призначені для Вашого особистого некомерційного використання. Всі матеріали, опубліковані на сайті захищені авторським правом і знаходяться у володінні або під контролем Компанії або сторони, яка є постачальником контенту. Ви повинні дотримуватися всіх додаткових повідомлень про авторські права, інформації або обмежень, що містяться на будь-якій сторінці.
                                    </p>
                                    <p>1.2. Зміст сайту захищений авторським правом відповідно до законодавства України та міжнародного авторського права. Ви не маєте права змінювати, публікувати, передавати, брати участь у передачі або продажу, відтворювати (за винятком випадків, передбачених в пункті 2.3, 2.4 та 2.5 цих Умов надання послуг), створювати нові твори, поширювати, виконувати, або яким-небудь чином використовувати зміст сайту (включаючи програмне забезпечення) в цілому або в частині.
                                    </p>
                                    <p>1.3. Ви можете завантажити або скопіювати вміст сайту, інші компоненти та елементи, що відображаються на сайті, тільки для особистого використання, за умови дотримання всіх авторських прав та інших повідомлень, що містяться в ньому.
                                    </p>
                                <p>1.4. Інтернет-виданням дозволяється безкоштовно використовувати інформацію, розміщену на сайтах Компанії, за умови відкритого гіперпосилання та згадки першоджерела не нижче першого абзацу. Для друкованих видань передрук матеріалів Компанії дозволяється на гонорарній основі та лише за письмової згоди редактора. Для мобільних додатків та SmartTV використання матеріалів дозволяється на гонорарній основі та лише за письмової згоди Компанії. Для ЗМІ дозволяється використовувати інформацію, розміщену на сайтах Компанії, за умови посилання на першоджерело. Під використанням інформації мається на увазі будь-яке відтворення, републікація, поширення, переробка, переклад, включення його частин до інших творів та інші способи, передбачені Законом України "Про авторське право та суміжні права".
                                </p>
                                <p>1.5. Використання матеріалів Компанії, що розміщуються на порталі 24tv.ua, шляхом їх повного або часткового відтворення агрегаторами новин дозволяється тільки з письмовоставі його звернення, направленого в електронній формі за адресою support@luxnet.ua. Компанія залишає за собого дозволу Компанії. Під «агрегаторами новин» слід розуміти будь-яке програмне забезпечення, додаток, сервіс або веб-ресурс, які за допомогою RSS-каналів або іншим способом збирають вміст інформаційних ресурсів і частково або повністю відтворює їх для користувачів у вигляді блоків, потоків, «стрічок» новин і т.п. Комапія надає письмовий дозвіл на використання своїх матеріалів на свій розсуд власнику агрегатора новин на підю право в процесі розгляду звернення вимагати від власника агрегатора новин будь-яку додаткову інформацію, необхідну для прийняття рішення про видачу письмового дозволу. Використання матеріалів Компанії можливе тільки після отримання відповідного письмового дозволу, який може бути направлено за поштовою адресою власника агрегатора новин або в електронному вигляді на адресу його електронної пошти. Письмовий дозвіл може поширюватися на окремий матеріал (матеріали) або на всі поточні і майбутні матеріали на ресурсах порталу 24tv.ua, і є дійсним протягом установленого в ньому строку.
                                </p>

                                <h3>2. Контент для користувачів: коментарі, огляди тощо.</h3>
                                <p> 2.1. Не дозволяється завантажувати, розповсюджувати та публікувати контент будь-якого наклепницького, образливого, непристойного, порнографічного, повторюваного (спам) чи іншого незаконного матеріалу.
                                </p>
                                <p>2.2. Матеріали сайту мають бути використані тільки в некомерційній формі. Ви не можете, без певного схвалення Компанії, поширювати або висвітлювати будь-який зміст, рекламу, тощо.
                                </p>
                                <p>2.3. Ви визнаєте, що будь-які матеріали поширені Вами, (наприклад контент, створюваний користувачами, в тому числі, але не обмежуючись ними: коментарі, форум, повідомлення, рецензії, текст, відео, аудіо та фотографій, а також комп'ютерний код і додатки) може бути видалений або змінений Компанією. Ви відмовляєтесь від будь-яких прав, які Ви можете мати в разі наявності такого матеріалу на сайті, а зміна матеріалів може бути здійснена навіть у разі якщо Ви не згодні. Матеріали також можуть бути включені в наші RSS-канали, API, і доступні для перевидання через інші формати.
                                </p>
                                <p>2.4. Ви надаєте Компанії, безстрокову, невиключну, по всьому світу, роялті-фрі, ліцензію на розміщені Вами матеріали, включаючи необмежене право Компанії або будь-якої третьої сторони, що дозволяє використовувати, копіювати, передавати, публікувати, поширювати, створювати похідні роботи, змінювати і адаптувати індекс, кеш, теги, кодувати, (включаючи без обмеження права на адаптацію до потокового завантаження, передачі, мобільного, цифрового сканування або інших технології) в будь-якій формі або засобах масової інформації, відомих зараз або в подальшому розроблені, в тому числі будь-які публікації, розміщені Вами на сайті.
                                </p>
                                <p>2.5. Ви несете повну відповідальність за зміст ваших публікацій. Компанія не має і не може кожен контролювати весь матеріал і не несе відповідальності за зміст цих повідомлень, Компанія залишає за собою право видаляти, переміщати або редагувати Публікації, які Компанія, за власним розсудом, вважає образливими, наклепницькими, непристойними, порушенням авторських прав і товарних знаків, або неприйнятними.
                                </p>
                                <p>2.6. Ви даєте згоду на відображення і публікацію на сайті розробленого Вами матеріалу, а також в оффлайн рекламних цілях.
                                </p>

                                <h3>3. Доступ і наявність послуг</h3>
                                <p>3.1. Матеріали можуть містити посилання, пов'язані з іншими World Wide Web Інтернет-сайтами, ресурсами та рекламодавцями. Так як ми не несемо відповідальності за доступність цих зовнішніх ресурсів або їх зміст, Ви повинні направляти будь-яке занепокоєння щодо будь-якого зовнішнього посилання адміністратору сайту.
                                </p>
                                <h3>4. Заяви та гарантії</h3>
                                <p>4.1. Ви запевнюєте, гарантуєте та обіцяєте:

                                    матеріали будь-якого роду, представлені через Ваш аккаунт:
                                    не будуть порушені, плагіатом або порушувати права третіх осіб, включаючи авторське право, товарні знаки, недоторканність приватного життя або інших особистих або майнових прав;
                                    містити наклепи чи інший незаконний матеріал;
                                    Ви щонайменше досягнули тринадцяти років.
                                </p>
                                <p>4.2. Компанія не гарантує і не підтверджує точності або надійності будь-яких порад, думок, заяв чи іншої завантаженої або розповсюдження інформації через аккаунти будь-яких користувачів, постачальників інформації або будь-яких інших фізичних чи юридичних осіб. Ви визнаєте та усвідомлюєте, що покладання на такі думки, поради, заяви, меморандуми або іншу інформацію повинно бути на свій страх і ризик. Матеріали сайту поширюються «ЯК Є», без будь –яких гарантій включаючи гарантії на право власності або придатності для конкретних цілей. цим ви визнаєте, що використання послуги на свій страх і ризик.
                                </p>

                                <h3>5. Реєстрація та безпека</h3>
                                    <p>5.1. Як частина процесу реєстрації або створення облікового запису, ви будете створювати облікові дані для входу, вибравши пароль та надання адреси електронної пошти. Ви також повинні надати нам певні відомості про себе, які повинні бути точними і оновленими.

                                    Кожна реєстрація для одного користувача. Ви не можете поділитися своїми обліковими даними реєстрації для входу, щоб ніхто інший не мав доступу до вашого аккаунта. Ми можемо скасувати або призупинити ваш доступ до сайту, якщо ви поділитеся своїми обліковими даними для входу. Ви несете відповідальність за збереження конфіденційності пароля, який Ви не повинні будете відкрити будь-якому представнику Компанії. Ви не можете:

                                    вибрати або використовувати облікові дані іншої людини з тією метою, щоб видати себе за цю людину;
                                    використовувати дані облікового запису без права дозволу власника;
                                    використовувати облікові дані, на свій розсуд, якщо вони є чи вважаються образливими.
                                    Недотримання вищезазначених положень вважається порушенням Правил, які можуть призвести до негайного припинення існування Вашого аккаунта.
                                    </p>
                                    <p>5.2. Будь ласка, повідомте support@luxnet.ua про будь-які відомі або передбачувані випадки несанкціонованого використання Вашого аккаунту, або про будь-яке відоме або передбачуване порушення безпеки, у тому числі втрати, крадіжки або несанкціонованого розкриття вашого пароля.
                                    </p>
                                <p>5.3. Ви повинні досягнути 13 років, щоб підписатися на всі види послуг сайту.
                                </p>
                                    <p>5.4. Ви несете відповідальність за будь-яке використання чи діяльність на вашому обліковому запису сайту, в тому числі за використання аккаунту третіми особами з вашого дозволу. Будь-яка шахрайська, образлива або інша протизаконна діяльність може бути підставою для припинення дій вашого облікового запису, на власний розсуд, і ми можемо направити відомості до відповідних правоохоронних органів.</p>

                            </div>
                        </div>

                        <label for="modal" class="button">Open modal</label>
                        <div class="form-group">
                            <input type="submit" value="Зареєструватися" class="btn btn-success pull-right">
                        </div>
                    </form>
                </div>
            </div>
        </div>
    </div>

    <style>

        label {
            cursor: pointer;
            user-select: none;
        }

        .modal {
            position: fixed;
            z-index:9999;
            top: 0;
            right: 100%;
            bottom: 0;
            width: 100%;
            display: flex;
            align-items: center;
            justify-content: center;
            background-color: rgba(0,0,0,.2);
            opacity: 0;
            transition: opacity .3s;
        }



        .modal__info {
            position: relative;
            width: 90%;
            max-width: 400px;
            max-height: 90%;
            padding: 20px 20px 5px;
            background-color: #fff;
            overflow: hidden;
            overflow-y: auto;
            -webkit-overflow-scrolling: touch;
        }

        .modal__close {
            font-family: serif;
            position: absolute;
            z-index: 2;
            top: 5px;
            right: 5px;
            width: 25px;
            border-radius: 50%;
            font-size: 36px;
            line-height: 25px;
            text-align: center;
        }

        .modal__closetwo {
            position: absolute;
            z-index: -1;
            top: 0;
            left: 0;
            right: 0;
            bottom: 0;
        }

        .modal__check:checked+.modal {
            opacity: 1;
            right: 0;
        }

        .button:hover,.modal__close:hover {opacity: 0.7;}
        .modal__info::-webkit-scrollbar {display: none;}

    </style>


<?php $__env->stopSection(); ?>
<?php echo $__env->make('layouts.master', array_except(get_defined_vars(), array('__data', '__path')))->render(); ?>